<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel='stylesheet' href='../rurple.css' type='text/css'>
<title>Reeborg explores its world</title>
</head>
<body>
<h2 class="title">2. Reeborg dünyas&#305;n&#305; ke&#351;fediyor</h2>
<p>Reeborg yaln&#305;zca dört hareket yapabilir: bir ad&#305;m ileriye gitmek, sola 
dönmek, bipleri almak ve koymak.Programlaman&#305;n sihriyle, Reeborg'un yaln&#305;zca bu 
dört temel hareketi kullanarak çok kar&#305;&#351;&#305;k i&#351;leri nas&#305;l yapt&#305;&#287;&#305;n&#305; 
ö&#287;reneceksiniz. Tüm bunlar&#305; ö&#287;renmeden önce size Reeborg'un dünyas&#305;n&#305; ve neye 
benzedi&#287;ini gösterece&#287;im.</p>
<p>Haz&#305;r oldu&#287;unuz zaman not defterindeki ikinci sayfay&#305; seçin; <i>Robot: 
Kod yaz ve Ö&#287;ren</i>, 
a&#351;a&#287;&#305;da gösterildi&#287;i gibi.<br>
<br>
 <img alt="Robot: Code and Learn tab" src=
"../../images/intro/code_tab.png"><br>
<br>
 Görünüm a&#351;a&#287;&#305;daki gibi olacakt&#305;r. Soldaki program penceresi ve sa&#287;daki de 
Robot'un dünyas&#305;d&#305;r.</p>
<center><img alt="2windows" src=
"../../images/intro/robot_window.jpg"></center>
<p>Reeborg'un dünyas&#305; caddeler (<i>streets</i>) ve sokaklarla (<i>avenues</i>) 
organize edilmi&#351;tir. Bunlar Reeborg'un pozisyonunu belirlemek için 
kullan&#305;lacakt&#305;r. Reeborg dört yönde hareket edebilir: kuzey (ekranda yukar&#305;ya), 
güney (ekranda a&#351;a&#287;&#305;ya), bat&#305; (ekranda sola) ve do&#287;u (ekranda sa&#287;a). Ba&#351;lang&#305;çta 
Reeborg birinci cadde ile birinci soka&#287;&#305;n kesi&#351;ti&#287;i kö&#351;ede yüzü do&#287;uya dönük ve 
bu yönde gitmeye haz&#305;r bir pozisyondad&#305;r. </p>
<h3><span class="try">S&#305;ra sizde</span></h3>
<p>Reeborg'u uyand&#305;rmak için üstüne t&#305;klay&#305;n! Tepki vermesini ummay&#305;n, ama bana 
inan&#305;n ki onu uyand&#305;rd&#305;n&#305;z. &#350;imdi klavyenizdeki yukar&#305; ve sol ok tu&#351;lar&#305;n&#305; 
kullanarak onu hareket ettirin Yukar&#305; ok tu&#351;u Reeborg'u bir ad&#305;m ileriye 
götürür, sol ok tu&#351;u sola dönmesini sa&#287;lar.</p>
<h3><span class="suggested">Deney!</span></h3>
<p>Reeborg'u dünyas&#305;n&#305;n s&#305;n&#305;rlar&#305;n&#305; geçmeye zorlarsan&#305;z ne olur?</p>
<center>
<a href="1-browser.htm"><img alt="previous" src=
"../../images/previous.png"> Taray&#305;c&#305; hakk&#305;nda</a> - 
<a href="../lessons_toc.htm"><img alt="home" src="../../images/home.png"></a> -
<a href="3-first_program.htm">&#304;lk Program <img alt="next" src=
"../../images/next.png"></a></center>
</body>
</html>
