<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=utf-8">
  <link rel="stylesheet" href="../rurple.css" type="text/css">
  <title>First program</title>
</head>
<body>
<h2 class="title">3. Primer programa</h2>
<p>Tal como hemos dicho antes, hay dos ventanas princiapales que se
usan para manejar a Reeborg. A la izquierda hay una ventana de
programa, donde escribes tus instrucciones para que Reeborg las siga. A
la derecha est&aacute; el "mundo gr&aacute;fico" de Reeborg, por donde
se mueve siguiendo las instrucciones que recibe.</p>
<p>Haz click en el bot&oacute;n de abrir programa&nbsp; <img
 alt="open program button" src="../../images/intro/btn_open_program.png">
y selecciona el archivo "move1.rur".
(<span class="warning">Nota:</span> dependiendo del ordenador que uses,
es posible que no veas la extensi&oacute;n ".rur") Ver&aacute;s lo que
se llama <em>c&oacute;digo de ordenador</em>, o <em>c&oacute;digo</em>,
que aparece en la ventana de programa.</p>
<pre>move()<br>turn_off()<br></pre>
<p>La palabra <em>c&oacute;digo</em> significa lo mismo que "progama".
Un&nbsp;<em>programa</em> es una serie de&nbsp;<em>instrucciones</em>.
En este caso, el programa est&aacute; formado por dos instrucciones.</p>
<ul>
  <li><tt>move()</tt>: le ordena a&nbsp;Reeborg que de un paso hacia
adelante.<br>
  </li>
  <li><tt>turn_off()</tt>: le dice a&nbsp;Reeborg qie no tenemos
m&aacute;s instrucciones que darle, y que se &nbsp;apague, para no
malgastar energ&iacute;a.</li>
</ul>
<p>Reeborg, para saber que le est&aacute;s dando una instrucci&oacute;n
necesita que le pongas los dos par&eacute;ntesis al final de cada
instrucci&oacute;n, si no, se hace un l&iacute;o.</p>
<p>Ahora, dale al bot&oacute;n <img alt="run program button"
 src="../../images/intro/btn_run.png"> y mira a&nbsp;Reeborg moverse en
su mundo.</p>
<h3 class="try">Tu turno</h3>
<p>Cambia el programa a&ntilde;adiendo otra instrucci&oacute;n&nbsp;<tt>move()</tt>
de esta manera:</p>
<pre>move()<br>move()<br>turn_off()<br></pre>
<p>Pulsa en bot&oacute;n guardar <img alt="save program button"
 src="../../images/intro/btn_save_program.png"> y ponle el
nombre&nbsp;"move2" Felicidades! Acabas de crear tu primer programa.
Ahora dile a Reeborg que ejecute el programa pulsando en el bot&oacute;n
<img alt="run program button" src="../../images/intro/btn_run.png">&nbsp;.</p>
<h3 class="suggested">Experimenta!</h3>
<p>Puedes ordenar a&nbsp;Reeborg que de m&aacute;s de dos pasos.
&iquest;Qu&eacute; pasa si le dices a Reeborg que d&eacute; tantos
pasos que se salga de su mundo? F&iacute;jate en la ventana de programa
que las instrucciones que se est&aacute;n ejecutando est&aacute;n
resaltadas.</p>
<center>
<a href="2-explore.htm"><img alt="previous"
 src="../../images/previous.png"> Reeborg explora su mundo;</a> - <a
 href="../lessons_toc.htm"><img alt="home" src="../../images/home.png"></a>
- <a href="4-errors.htm">Manejandose con los eRRoRes <img alt="next"
 src="../../images/next.png"></a>
</center>
</body>
</html>
