<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel='stylesheet' href='../rurple.css' type='text/css'>
<title>Building walls</title>
</head>
<body>
<h2 class="title">9. Duvarlar&#305; yapmak</h2>
<p>Duvarlar ekleyerek Reeborg'un dünyas&#305;n&#305; de&#287;i&#351;tirebilirsiniz. Duvar eklemek 
için&nbsp; <img alt="edit walls button" src="../../images/intro/btn_walls.png"> 
butonuna bas&#305;l&#305;r ve a&#351;a&#287;&#305;daki gibi bir görüntü olu&#351;ur.</p>
<center><img alt="buildwalls" src=
"../../images/intro/buildwalls.png"></center>
<p>K&#305;rm&#305;z&#305; noktalar&#305;n aras&#305;ndaki çizgilere t&#305;klayarak duvar ekleyebilir yada 
kald&#305;rabilirisiniz. Ancak s&#305;n&#305;rlardaki duvarlar&#305; kald&#305;ramazs&#305;n&#305;z.</p>
<center><img alt="wall1img" src="../../images/intro/wall1img.png"></center>
<p> <img alt="edit walls button" src=
"../../images/intro/btn_walls.png"> butonuna yeniden bast&#305;&#287;&#305;n&#305;zda k&#305;rm&#305;z&#305; 
noktalar kaybolur ama yeni yapt&#305;&#287;&#305;n&#305;z duvarlar muhafaza edilir.</p>
<h3 class="try">S&#305;ra sizde</h3>
<p>A&#351;a&#287;&#305;daki ilk &#351;ekildeki gibi bir dünya yarat&#305;n (bir kaç ders önce gördü&#287;ünüz 
gibi onu kaydedin) sonra a&#351;a&#287;&#305;daki ikinci &#351;ekilde oldu&#287;u gibi robotun hareket 
etmesini sa&#287;layan bir program yaz&#305;n. </p>
<div><img alt="loopstart" src="../../images/intro/loopstart.png"> <br />
<img alt="lead to" src="../../images/lead_to.png"> <img alt="loopend" src=
"../../images/intro/loopend.png"></div>

<!--=====================================================-->
<hr width="50%">

<h3 class="suggested">Sizi U&#287;ra&#351;t&#305;ral&#305;m</h3>
<p>Bu dersi bir kaç al&#305;&#351;t&#305;rmayla bitirece&#287;iz. Bu al&#305;&#351;t&#305;rmalar&#305; yaparken çok 
zorlanmamal&#305;s&#305;n&#305;z, hatta bu seviyedeyken biraz s&#305;k&#305;labilirsiniz ancak bu 
al&#305;&#351;t&#305;rmalar&#305;n ilerleyen derslerde size çok yard&#305;m&#305; olacak.</p>
<h3 class="quiz">Gazete da&#287;&#305;t&#305;m&#305;</h3>
<p>Reeborg mahallesinde gazete da&#287;&#305;t&#305;m&#305; yapar. A&#351;a&#287;&#305;daki &#351;ekilde oldu&#287;u gibi, 
evin kap&#305;s&#305;n&#305;n önündeki merdivenleri ç&#305;kacak, gazeteyi son basama&#287;a b&#305;rakacak 
(gazete bip ile temsil edilecek) ve ba&#351;lad&#305;&#287;&#305; noktaya geri dönecek. newspaper.wld 
dünya dosyas&#305;n&#305; açarak a&#351;a&#287;&#305;daki &#351;ekle ula&#351;abilirsiniz. Ba&#351;lang&#305;çta Reeborg'a 
bir bip(gazete) vermeyi unutmay&#305;n.</p>
<center><img alt="newspaper start" src=
"../../images/intro/newspaper_start.png"></center>
<center><img alt="lead to" src="../../images/lead_to.png"> <img alt=
"newspaper end" src="../../images/intro/newspaper_end.png"></center>
<p>Bu görevin yerine getirilebilmesi için 50'den fazla komut vermeniz gereklidir 
buda uzun bir yazma zaman&#305;n&#305; gerektirir. Program&#305;n&#305;z ne kadar uzun olursa 
buglarla kar&#351;&#305;la&#351;ma &#351;ans&#305;n&#305;z o kadar artar. Bir sonraki bölümde 
Python'u 
kullanarak bu al&#305;&#351;t&#305;rmay&#305; nas&#305;l basit hale getirebilece&#287;imizi anlataca&#287;&#305;m. </p>
<hr width="50%">
<h3 class="quiz">Engelleri atlamak</h3>
<p>Reeborg engelli atlama yar&#305;&#351;mas&#305;na kat&#305;l&#305;yor. A&#351;a&#287;&#305;daki &#351;ekillerde oldu&#287;u 
gibi Reeborg'un yar&#305;&#351;may&#305; h&#305;zl&#305; bir &#351;ekilde tamamlamas&#305;n&#305; sa&#287;layan bir program 
yaz&#305;n, dünya dosyas&#305;
hurdles1.wld.</p>
<center><img alt="hurdles start" src=
"../../images/intro/hurdles1_start.png"></center>
<center><img alt="lead to" src="../../images/lead_to.png"> <img alt=
"hurdles end" src="../../images/intro/hurdles1_end.png"></center>
<p>Bir sonraki derste ayn&#305; i&#351;i çok daha k&#305;sa bir programla nas&#305;l yapaca&#287;&#305;m&#305;z&#305; 
ö&#287;renece&#287;iz. Daha sonra engellerin otomatik olarak nas&#305;l atlanaca&#287;&#305;n&#305; 
ö&#287;renece&#287;iz. Engeller farkl&#305; yükseklikte ve farkl&#305; aral&#305;klarda olsa dahi bunu 
yapabilece&#287;iz. </p>
<hr width="50%">
<h3 class="quiz">Hasat zaman&#305;</h3>
<p>Hasat zaman&#305;! Reeborg'un evinin bahçesindeki havuçlar&#305; (bipler) toplamas&#305;n&#305; 
sa&#287;layan bir program yaz&#305;n&#305;z, dünya dosyas&#305; harvest1.wld.</p>
<img alt="harvest start" src="../../images/intro/harvest1.png">
<p>&#304;lerleyen derslerde ayn&#305; i&#351;i çok daha k&#305;sa bir programla nas&#305;l yapaca&#287;&#305;m&#305;z&#305; 
ö&#287;renece&#287;iz. Daha sonra Reeborg'a rasgele yerlerdeki havuçlar&#305; nas&#305;l 
toplayaca&#287;&#305;n&#305; ö&#287;retece&#287;iz. </p>
<hr width="50%">
<h3 class="quiz">Sa&#351;&#305;rt&#305;c&#305; kaç&#305;&#351;!</h3>
<p>Reeborg labirentte kaybolmu&#351;tur, labirentten ç&#305;kmas&#305;na yard&#305;mc&#305; olun. En k&#305;sa 
yol a&#351;a&#287;&#305;da gösterilmi&#351;tir, dünya dosyas&#305;: maze1.wld.</p>
<div><img alt="maze start" src="../../images/intro/maze1_start.png">
<img alt="lead to" src="../../images/lead_to.png"> <img alt="maze end" src=
"../../images/intro/maze1_end.png"></div>
<p>Sonraki derslerde Reeborg'un farkl&#305; labirentlerde kendi kendine <b>ayn&#305; 
program&#305;</b> kullanarak yolunu nas&#305;l bulaca&#287;&#305;n&#305; ö&#287;renece&#287;iz. </p>
<center><a href="8-bugs.htm"><img alt="previous" src=
"../../images/previous.png"> Buglar!</a> - 
<a href="../lessons_toc.htm"><img alt=
"home" src="../../images/home.png"></a> - <A href="10-def.htm">Tekrardan 
kesinlikle kaç&#305;n&#305;n <img alt="next" src=
"../../images/next.png"></a></center>
</body>
</html>
