<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
  <meta http-equiv="Content-Type"
 content="text/html; charset=utf-8">
  <link rel="stylesheet" href="../rurple.css" type="text/css">
  <title>Building walls</title>
</head>
<body>
<h2 class="title">9. Construyendo paredes</h2>
<p> Puedes cambiar f&aacute;cilmente el mundo de Reeborg
a&ntilde;adiendo paredes.Para ello pulsa en el bot&oacute;n <img
 alt="edit walls button" src="../../images/intro/btn_walls.png"> y la
pantalla cambiar&aacute; y se ver&aacute; as&iacute;:</p>
<center><img alt="buildwalls" src="../../images/intro/buildwalls.png"></center>
<p>Pulsando en la l&iacute;nes roja a trazos entre dos "pilares",
puedes a&ntilde;adir o borrar una pared. F&iacute;jate en que no puedes
quitar las paredes del borde.</p>
<center><img alt="wall1img" src="../../images/intro/wall1img.png"></center>
<p>Si pulsas en <img alt="edit walls button"
 src="../../images/intro/btn_walls.png"> otra vez, se eliminan los
pilares y las l&iacute;neas rojas desaparecen, pero las paredes nuevas
permanecen.</p>
<h3 class="try">Tu turno</h3>
<p>Crea un mundo igual al indicado abajo (y <span class="important">gu&aacute;rdalo</span>
tal como has aprendido hace unas pocas lecciones) y despu&eacute;s
escribe un programa que gu&iacute;e a Reeborg hasta salir por la parte
de abajo, siguiendo el camino indicado.</p>
<div><img alt="loopstart" src="../../images/intro/loopstart.png"> <br>
<img alt="lead to" src="../../images/lead_to.png"> <img alt="loopend"
 src="../../images/intro/loopend.png"></div>
<!--=====================================================-->
<hr width="50%">
<h3 class="suggested">A ver si eres capaz...</h3>
<p>Terminamos esta lecci&oacute;n con unos pocos ejercicios. Estos
ejercicios no deber&iacute;an ser demasiado dif&iacute;ciles de hacer,
en realidad, llegados a este punto, quiz&aacute; podr&iacute;an
resultar un poco tediosos,... pero <b>de verdad</b> te ser&aacute;n de
gran ayuda en las pr&oacute;ximas lecciones.</p>
<h3 class="quiz">Repartidor de peri&oacute;dicos</h3>
<p>Reeborg reparte peri&oacute;dicos a sus vecinos. Haz que suba las
escaleras de la puerta principal de una casa, deje caer el
peri&oacute;dico (representado por un beeper) en el escal&oacute;n
superior, y vuelva a su punto de partida, tal como se indica abajo. El
fichero de mundo es el newspaper.wld.</p>
<center><img alt="newspaper start"
 src="../../images/intro/newspaper_start.png"></center>
<center><img alt="lead to" src="../../images/lead_to.png"> <img
 alt="newspaper end" src="../../images/intro/newspaper_end.png"></center>
<p>Para realizar esta tarea, te dar&aacute;s cuenta que se necesita
darle a Reeborg m&aacute;s de 50 &oacute;rdenes, lo que requiere
bastante trabajo tecleando. Cuanto m&aacute;s se teclea m&aacute;s
errores (bugs!) pueden ocurrir. En el pr&oacute;ximo cap&iacute;tulo
veremos c&oacute;mo podemos usar Python para simplificar
considerablemente la soluci&oacute;n de este ejercicio.</p>
<hr width="50%">
<h3 class="quiz">Saltando obst&aacute;culos</h3>
<p>Reeborg est&aacute; participando en una carrera de
obst&aacute;culos. Escribe el programa que le haga segur el camino
indicado abajo, hasta llegar a la meta. El fichero de mundo es el
hurdles1.wld.</p>
<center><img alt="hurdles start"
 src="../../images/intro/hurdles1_start.png"></center>
<center><img alt="lead to" src="../../images/lead_to.png"> <img
 alt="hurdles end" src="../../images/intro/hurdles1_end.png"></center>
<p>En la pr&oacute;xima lecci&oacute;n veremos c&oacute;mo escribir un
programa corto para realizar la misma tarea. M&aacute;s tarde,
aprenderemos c&oacute;mo ense&ntilde;arle a Reeborg a saltar
obst&aacute;culos de diferentes alturas y espaciados
autom&aacute;ticamente.</p>
<hr width="50%">
<h3 class="quiz">Es tiempo de cosecha</h3>
<p>&iexcl;Es tiempo de cosecha! Haz que Reeborg recoja todas las
zanahorias (representadas por beepers) de su jard&iacute;n. El fichero
de mundo es el harvest1.wld.</p>
<img alt="harvest start" src="../../images/intro/harvest1.png">
<p>M&aacute;s tarde aprenderemos c&oacute;mo escribir un programa mucho
m&aacute;s corto que haga la misma tarea. Y luego le ense&ntilde;aremos
a Reeborg qu&eacute; hacer si faltan zanahorias en cualquier sitio.</p>
<hr width="50%">
<h3 class="quiz">Huida</h3>
<p>Reeborg est&aacute; perdido en un laberinto. Ay&uacute;dale a salir.
El camino m&aacute;s corto posible est&aacute; indicado abajo. El
fichero de mundo es el maze1.wld.</p>
<div><img alt="maze start" src="../../images/intro/maze1_start.png">
<img alt="lead to" src="../../images/lead_to.png"> <img alt="maze end"
 src="../../images/intro/maze1_end.png"></div>
<p>En una lecci&oacute;n posterior, vermos c&oacute;mo ense&ntilde;ar a
Reeborg a encontrar el camino, usando <b>el mismo</b> programa para
salir de muchos laberintos distintos. </p>
<center><a href="8-bugs.htm"><img alt="previous"
 src="../../images/previous.png"> Malditos bichos!</a> - <a
 href="../lessons_toc.htm"><img alt="home" src="../../images/home.png"></a>
- <a href="10-def.htm">Evitando repeticiones para siempre <img
 alt="next" src="../../images/next.png"></a></center>
</body>
</html>
