Repository: aroberge/rur-ple
Catalog: branches/1.0/rur_locale/*/*.po
Languages: es, fr

source: RUR: a Python Learning Environment
es: RUR: entorno de aprendizaje Python
fr: RUR: l'apprentissage de Python

source: RUR: Read and Learn
es: RUR: Lee y aprende
fr: RUR: lire et apprendre

source: Robot: Code and Learn
es: Robot: Codifica y aprende
fr: Robot: coder et apprendre

source: Python: Code and Learn
es: Python: Codifica y aprende
fr: Python: coder et apprendre

source: Python: simple editor
es: Python: editor simple
fr: Python: simple éditeur

source: Robot program has changed. You may save it before quitting.
fr: Le programme du robot a changé. Vous pouvez le sauvegarder avant de quitter.

source: Program has been changed
es: El programa ha sido modificado
fr: Votre programme a été modifié

source: World files (*.wld)|*.wld| All files (*.*)|*.*
es: Ficheros mundo (*.wld)|*.wld| Todos los ficheros (*.*)|*.*
fr: Fichiers monde (*.wld)|*.wld| Tous les fichiers (*.*)|*.*

source: Choose a file
es: Selecciona un fichero
fr: Choisissez un fichier

source: Problem with %s Please recreate world file.
fr: Problème avec %s SVP, recréez le fichier monde.

source: Invalid world file format
es: Formato del fichero mundo no es correcto
fr: Format du fichier 'monde' invalide

source: streets
es: las calles
fr: rues

source: beepers
es: los zumbadores
fr: sonnettes

source: walls
es: los muros
fr: murs

source: Save new world as
es: Guardar fichero mundo como
fr: Sauvegarder le fichier monde sous

source: Program files (*.rur)|*.rur| All files (*.*)|*.*
es: Ficheros programa (*.rur)|*.rur| Todos los ficheros (*.*)|*.*
fr: Fichiers programmes (*.rur)|*.rur| Tous les fichiers (*.*)|*.*

source: Save new program as
es: Guardar fichero como
fr: Sauvegarder le fichier sous

source: Program will not be saved.
es: El programa no se guardará.
fr: Le programme ne sera pas sauvegardé.

source: Program is running
es: Programa en ejecución
fr: En cours d'exécution

source: Program paused
es: Programa en pausa
fr: Pause - en attente

source: Program not running
es: Programa parado
fr: Arrêt complet

source: No robot in world to give beepers to.
es: No hay robot en el mundo
fr: Pas de robot dans ce monde.

source: Beepers!
es: Sonidos!
fr: Sonnettes!

source: World size!
es: Dimensiones del mundo!
fr: Grandeur du monde!

source: Opens existing robot program
es: Abrir fichero de programa robot
fr: Ouvrir fichier programme robot

source: Saves robot program
es: Guardar programa robot
fr: Sauvegarder fichier programme robot

source: Opens existing world file
es: Abrir fichero mundo
fr: Ouvrir fichier monde

source: Saves world file
es: Guardar fichero mundo
fr: Sauvegarder fichier monde

source: Resets world - from open file
es: Reiniciar mundo desde el fichero
fr: Remise à zéro du fichier monde

source: Runs robot program
es: Ejecutar programa robot
fr: Exécute programme robot

source: Steps through robot program instructions
es: Siguiente paso en las instrucciones del programa robot
fr: Exécute une instruction à la fois

source: Pause program
es: Pausar programa
fr: Pause le programme

source: Stops program
es: Parar programa
fr: Arrête le programme

source: Adjust robot speed
es: Ajustar velocidad robot
fr: Ajuste la vitesse du robot

source: Edit walls
es: Editar muros
fr: Éditer les murs

source: Resize world
es: Modificar dimensiones del mundo
fr: Changer les dimensions du monde

source: Give beepers to robot
es: Dar sonidos al robot
fr: Donner des sonnettes au robot

source: Remove/add robot from/to world
es: Mostrar/Ocultar el robot al mundo
fr: Enlever ou remettre un robot dans le monde

source: Toggle world file view
es: Mostrar/Ocultar el fichero mundo
fr: Montrer ou cacher le fichier monde

source: Open Python file
es: Abrir fichero Python
fr: Ouvrir fichier Python

source: Save Python file
es: Guardar fichero Python
fr: Sauvegarder fichier Python

source: Run Python program
es: Ejecutar programa Python
fr: Exécuter programme Python

source: Run program with argument list
fr: Exécuter le programme avec une liste d'arguments

source: Help
fr: Aide

source: Go to line number
fr: Aller à la ligne numéro

source: Hide or show output window
fr: Montrez ou cacher la fenêtre des résultats

source: Change layout
fr: Changer la disposition des fenêtres

source: Clear text
fr: Effacer le texte

source: Open local html file
es: Abrir fichero local html
fr: Ouvrier fichier local html

source: Go back in browser history
es: Retroceder en el histórico de navegación
fr: Page précédente - historique du fureteur

source: Home
es: Inicio
fr: Maison

source: Go forward in browser history
es: Avanzar en el histórico de navegación
fr: Page suivante - historique du fureteur

source: Select a language
es: Seleccionar un lenguaje
fr: Choisissez la langue

source: html files (*.htm*)|*.htm*| All files (*.*)|*.*
es: Ficheros html (*.htm*)|*.htm*| Todos los ficheros (*.*)|*.*
fr: Fichiers html (*.htm*)|*.htm*| Tous les fichiers (*.*)|*.*

source: Error found in your program.
es: Error encontrado en la línea %s.
fr: Erreur détectée dans votre programme.

source: Hey! You stopped me!
es: Hey! Me has parado!
fr: Pourquoi m'avez-vous arrêté?

source: All done!
es: Terminado!
fr: Terminé

source: No instruction to execute.
es: Noy ninguna instrucción que ejucutar.
fr: Plus d'instructions à suivre.

source: You forgot to turn me off!
es: Olvidaste desconectarme!
fr: Vous avez oublié de m'arrêter!

source: Error found near line %s.
es: Error encontrado en la línea %s. (Quizás desactive el indicador de instrucción en curso)
fr: Erreur détectée près de la ligne %s.

source: Execution error
es: Error en ejecución
fr: Erreur d'exécution

source: %s Unrecognized instruction.
es: %sInstrucción no reconocida.
fr: %s Instruction inconnue.

source: Error
fr: Erreur

source: Turn off
es: Desconectar
fr: Arrêt

source: Success!
es: Éxito!
fr: Succès!

source: Select the desired value, or sum of values as the number of beepers to put in the robot's beeper bag.
es: Selecciona el número de sonidos para meter en la bolsa del robot
fr: Choisissez le nombre de sonnettes à donner au robot.Le nombre choisi sera la somme de deux valeurs.

source: Select the desired world dimensions (streets and avenues). The existing walls and beepers will be removed.
es: Selecciona las dimensiones del mundo que desees (calles y avenidas). Los muros y sonidos que existen desaparecerán.
fr: Choisissez la grandeur du monde (rues and avenues).Les murs existants et les sonnettes disparaîtront.

source: Found a word not allowed:
es: Palabra no permitida:
fr: Mot interdit utilisé dans le programme:

source: That move really hurt! Please, make sure that there is no wall in front of me!
es: El movimiento es algo complicado! Asegurate que no hay un muro en frente!
fr: Ceci a fait vraiment mal!Svp, évitez de me demander de foncer dans un mur!

source: I obey your command: turning myself off.
es: Obedezco tu instrucción: me desconecto.
fr: Je vous obéis. J'arrête pour économiser mes piles.

source: put_beeper() failed. I am not carrying any beepers.
es: El comando put_beeper() falló. No llevo ningun sonido.
fr: Je ne peux exécuter la commande put_beeper(). Je n'ai plus de sonnettes.

source: pick_beeper failed. I must be next to a beeper before I can pick it up.
es: El comando pick_beeper() falló. Debo estar junto a un sonido antes de poder cojerlo.
fr: Je ne peux exécuter la commande pick_beeper(). Je dois être tout près d'une sonnette pour la ramasser.

source: Setting delay failed. Accepted values are between 0 and 10.
es: Fallo en el ajueste de la velocidad. Los valores aceptados son entre 0 y 10.
fr: Je ne peux ajuste le délai à la valeur désirée. Les valeurs acceptables sont entre 0 et 10.

source: No program loaded
es: Programa no cargado
fr: Pas de programme

source: Robot has %s beeper
es: El Robot tiene %s zumbador
fr: Le robot a %s sonnette

source: Default world
es: Mundo por defecto
fr: Monde par défault

source: No robot in this world
es: No hay robot en el mundo
fr: Pas de robot dans ce monde.

source: World file: %s
es: Fichero mundo: %s
fr: Fichier monde: %s

source: Program File: %s
es: Fichero de programa: %s
fr: Fichier programme: %s

source: Robot has %s beepers
es: El Robot tiene %s zumbadores
fr: Le robot a %s sonnettes

source: not found in module useful.
es: no encontrado en el modulo "useful.
fr: n'existe pas dans le module useful.

source: import keyword used improperly
es: uso indebido de la instruccion "import"
fr: utilisation non permise du mot "import"

source: Street
es: Calle
fr: Rue

source: avenues
es: las avenidas

source: robot
es: el robot

source: Avenue
es: Avenida
