Repository: aroberge/rur-ple
Catalog: branches/1.0/rur_locale/*/welsh.po
Languages: cy

source: RUR: a Python Learning Environment
cy: RUR: Awyrgylch Dysgu Python

source: RUR: Read and Learn
cy: RUR: Darllen a Dysgu

source: Robot: Code and Learn
cy: Robot: Codio a Dysgu

source: Python: Code and Learn
cy: Python: Codio a Dysgu

source: Python: simple editor
cy: Python: golygydd syml

source: Robot program has changed. You may save it before quitting.
cy: Mae'r rhaglen Robot wedi newid. Mi gewch ei gadw cyn terfynu.

source: Program has been changed
cy: Mae'r rhaglen wedi'i newid.

source: World files (*.wld)|*.wld| All files (*.*)|*.*
cy: Ffeiliau byd (*.wld)|*.wld| Pob ffeil (*.*)|*.*

source: Choose a file
cy: Dewis ffeil

source: Problem with %s Please recreate world file.
cy: Problem efo %s Mae angen ail-greu'r ffeil fyd.

source: avenues
cy: rhodfeydd

source: Invalid world file format
cy: Fformat annilys am y ffeil fyd.

source: streets
cy: strydoedd

source: beepers
cy: bipwyr

source: walls
cy: waliau

source: Save new world as
cy: Cadw'r byd newydd fel

source: Program files (*.rur)|*.rur| All files (*.*)|*.*
cy: Ffeiliau rhaglen (*.rur)|*.rur| Pob ffeil (*.*)|*.*

source: Save new program as
cy: Cadw'r rhaglen newydd fel

source: Program will not be saved.
cy: Ni chedwir y rhaglen.

source: Program is running
cy: Mae'r rhaglen yn rhedeg

source: Program paused
cy: Rhaglen wedi'i seibio

source: Program not running
cy: Nid yw'r rhaglen yn rhedeg

source: No robot in world to give beepers to.
cy: Does dim robot yn y byd i roi blipwyr iddo.

source: Beepers!
cy: Blipwyr!

source: World size!
cy: Maint y byd!

source: Opens existing robot program
cy: Agor rhaglen robot sydd mewn bod eisoes

source: Saves robot program
cy: Cadw rhaglen robot

source: Opens existing world file
cy: Agor ffeil fyd sydd mewn bod eisoes

source: Saves world file
cy: Cadw ffeil fyd

source: Resets world - from open file
cy: Ailosod y byd oddi wrth ffeil agored

source: Runs robot program
cy: Rhedeg rhaglen robot

source: Steps through robot program instructions
cy: Camu drwy gyfarwyddiadau y rhaglen robot

source: Pause program
cy: Seibio'r rhaglen

source: Stops program
cy: Stopio'r rhaglen

source: Adjust robot speed
cy: Newid cyflymder y robot

source: Edit walls
cy: Golygu waliau

source: Resize world
cy: Ailfeintio byd

source: Give beepers to robot
cy: Rhoi blipwyr i'r robot

source: Remove/add robot from/to world
cy: Tynnu/ychwanegu'r robot o/i'r byd

source: Toggle world file view
cy: Dangos/cuddio'r ffeil fyd

source: Open Python file
cy: Agor ffeil Python

source: Save Python file
cy: Cadw ffeil Python

source: Run Python program
cy: Rhedeg rhaglen Python

source: Run program with argument list
cy: Rhedeg rhaglen efo rhestr o ymresymiadau

source: Help
cy: Cymorth

source: Go to line number
cy: Mynd i rif llinell

source: Hide or show output window
cy: Dangos/cuddio'r ffenestr allbwn

source: Change layout
cy: Newid haenlun

source: Clear text
cy: Clirio'r testun

source: Open local html file
cy: Agor ffeil leol html

source: Go back in browser history
cy: Yn ôl yn hanes y porydd

source: Home
cy: Hafan

source: Go forward in browser history
cy: Ymlaen yn hanes y porydd

source: Select a language
cy: Dewis iaith

source: html files (*.htm*)|*.htm*| All files (*.*)|*.*
cy: Ffeiliau html (*.htm*)|*.htm*| Pob ffeil (*.*)|*.*

source: Error found in your program.
cy: Cafwyd gwall yn eich rhaglen.

source: Hey! You stopped me!
cy: Hei! Rydych wedi fy stopio!

source: All done!
cy: Wedi gorffen!

source: No instruction to execute.
cy: Dim cyfarwyddiad i'w weithredu.

source: You forgot to turn me off!
cy: Rydych wedi anghofio cau fi i lawr!

source: Error found near line %s.
cy: Gwall wrth ymyl llinell %s.

source: Execution error
cy: Gwall gweithredu

source: %s Unrecognized instruction.
cy: %s Cyfarwyddiad anadnabyddus.

source: Error
cy: Gwall

source: Turn off
cy: Terfynu

source: Success!
cy: Llwyddiant!

source: Select the desired value, or sum of values as the number of beepers to put in the robot's beeper bag.
cy: Dewiswch y gwerth dymunol, neu gyfanswm o werthau, fel nifer y blipwyr i'w rhoi ym mag blipwyr y robot.

source: Select the desired world dimensions (streets and avenues). The existing walls and beepers will be removed.
cy: Dewiswch ddimensiynau dymunol y byd (strydoedd a rhodfeydd).<br>Gwaredir y waliau a blipwyr sydd yma eisoes.

source: Found a word not allowed:
cy: Cafwyd gair anghaniataol:

source: That move really hurt! Please, make sure that there is no wall in front of me!
cy: Naeth y symudiad yno frifo go iawn! Plîs, sicrhewch nad oes wal ar fy mlaen!

source: I obey your command: turning myself off.
cy: Dwi'n ufuddhau eich gorchymyn: dwi'n cau i lawr.

source: put_beeper() failed. I am not carrying any beepers.
cy: Methodd put_bleeper(). Nid wyf yn cario blipwyr.

source: pick_beeper failed. I must be next to a beeper before I can pick it up.
cy: Methodd pick_bleeper(). Rhaid i mi fod wrth ymyl blipiwr cyn ei godi.

source: Setting delay failed. Accepted values are between 0 and 10.
cy: Methodd gosod yr oediad. Dylai'r gwerthoedd derbyniol fod rhwng 0 a 10.

source: No program loaded
cy: Dim rhaglen wedi'i llwytho

source: Robot has %s beeper
cy: Mae gan y robot %s o flipwyr

source: Default world
cy: Byd rhagosodol

source: No robot in this world
cy: Nid oes robot yn y byd yma

source: World file: %s
cy: Ffeil fyd: %s

source: Program File: %s
cy: Ffeil raglen: %s

source: Robot has %s beepers
cy: Mae gan y robot %s o flipwyr

source: not found in module useful.
cy: dim ar gael yn y module useful

source: import keyword used improperly
cy: defnyddwyd yr allweddair import yn anghywir

source: Avenue
cy: Rhodfa

source: Street
cy: Stryd
