<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content=
"text/html; charset=iso-8859-1">
<link rel='stylesheet' href='rurple.css' type='text/css'>
<title>RUR-PLE</title>
</head>
<body>
<h2 class="title">Python erlernen: Ein Kinderspiel mit RUR-PLE!</h2>
<h6>
<img src=
"../images/splash_screen_small.png" alt=""> André Roberge, © 2004, 2005, 2006</h6> 
<p><a href="about.htm">&Uuml;ber RUR-PLE</a> <br />
<a href="acknowledgements.htm">Wissenswertes</a><br />
<a href="summary.htm">Befehlssammlung</a><br />
</p>
<p>
    Das Erlernen der Computerprogrammierung sollte Spa&szlig; machen, Erwachsenen genau so wie Kindern.
    RUR-PLE ist eine Umgebung, die dazu entwickelt wurde, das Programmieren von Computern unter
    zuhilfenahme der Sprache Python zu erleichtern.
    In einer k&uuml;nstlichen Welt in der ein Roboter so programmiert werden kann, dass
    er verschiedene Aufgaben erledigt, werden Sie lernen, was es hei&szlig;t, ein Computerprogramm
    unter Benutzung von Python zu schreiben.
    Sie haben auch die M&ouml;glichkeit, ihre erlernten Fähigkeiten in einer eher konventionellen
    Umgebung unter Benutzung des eingebauten Interpreters anzuwenden.
    Auch wenn ihnen dies alles bislang noch nicht viel sagt brauchen sie sich keine Gedanken machen.
</p>
<p>
    Obwohl programmieren lernen Spaß machen kann, m&uuml;ssen sie dennoch ihrerseits Einsatz zeigen.
    Ich werde ihre Unterstüzung sein, so dass sie alleine lernen k&ouml;nnen; wie auch immer,
    solange sie keine eigenen Programme schreiben, werden sie auch nichts lernen.
    Es ist wichtig, dass sie dies als grundlegende Regel sehen.
</p>
<dl>
<dt><b>Regel # 1</b></dt>
<dd>
    Das Erlernen der Computerprogrammierung ist nicht anders wie das Erlernen eines Musikinstuments:
    sie m&uuml;ssen es <b>tun</b> und nicht nur dar&uuml;ber lesen.
</dl>
<p>
    Die zweite Regel ist das wichtigste und meist geh&uuml;tete Geheimnis f&uuml;r das Schreiben von
    Computerprogrammen.
</p>
<dl>
<dt><b>Regel # 2</b></dt>
<dd>
    Schreibe deine Programme so, dass sie für <b>Menschen</b> einfach zu lesen sind.</dd>
</dl>
<p>
    Ja, richtig, schreiben sie ihre Programme so, dass Menschen wie sie ihre Programme problemlos
    alleine lesen und verstehen k&ouml;nnen.
    Computersprachen sind dazu erstellt worden um mit Computern kommunizieren zu k&ouml;nnen,
    genau wie die menschliche Sprache sich dazu entwickelt hat, dass Menschen sich untereinander
    unterhalten k&ouml;nnen.
    Computersprachen sind aber einfacher als menschliche Sprache und werden oft dazu benutzt,
    dass Programmierer ihre Arbeit mit anderen teilen k&ouml;nnen.
    Genau so wie sie ihre F&auml;higkeiten im Deutsch-Schreiben verbessern wenn sie gut geschriebene
    B&uuml;cher lesen, k&ouml;nnen sie ihre Programmierkenntnisse ebenso durch gut geschriebene
    Programme verbessern.
    Trotzdem m&uuml;ssen sie sie immer noch selber schreiben und zu wissen, wie es geht.
</p>
<p>
    Um mit dem Programmieren zu beginnen werden sie auf dem Bildschirm einem Roboter
    namens Reeborg verschiedene Aufgaben zuweisen. Während sie dies machen werden sie
    grundlegende Programmierkonzepte und eine Sprache namens Python lernen.
    Später werden sie Reeborg verlassen und lernen, wie sie andere Dinge mit dem Computer
    machen k&ouml;nnen.
</p>
<h3 class="section">&Uuml;bungen</h3>
<p>
    Eine Liste aller &Uuml;bungen ist verf&uuml;gbar, aber sie sollten sie <b><i>nicht</i></b>
    im RUR-PLE Browser ansehen; Sie sollten ihren Lieblingsbrowser dazu benutzen.
    Wenn sie die Seiten innerhalb des RUR-PLE Browsers lesen werden erweiterte html-Stile nicht
    korrekt angezeigt und das Aussehen der &Uuml;bungen ver&auml;ndern.<br />
    <a href="lessons_toc.htm">&Uuml;bungen</a><br />
</p>
</body>
</html>
