<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<link rel='stylesheet' href='../rurple.css' type='text/css'>
<title>Any comments?</title>
<style>
<!--
div.Section1
	{page:Section1;}
-->
</style>
</head>
<body>
<h2 class="title">5. Aç&#305;klaman&#305;z var m&#305;? <i>Avez-vous des
commentaires?</i></h2>
<p>&#304;lk yazd&#305;&#287;&#305;n&#305;z program&#305; aç&#305;n. Size söyledi&#287;im gibi onu kaydetmi&#351;tiniz, de&#287;il 
mi? E&#287;er kaydetmediyseniz yeniden yaz&#305;n, sizi bekliyorum.</p>
<p>Tamam, program&#305;n&#305;z program penceresinde görüntüleniyor olmal&#305;. &#350;imdi, bir 
bilgisayar program&#305; yazarken en önemli &#351;eyin ne oldu&#287;unu hat&#305;rlay&#305;n, bunu size 
söylemi&#351;tim. E&#287;er hat&#305;rlam&#305;yorsan&#305;z ba&#351;lang&#305;ca dönün ve yeniden okuyun.</p>
<p>Bekliyorum ...</p>
<p>Evet, yapman&#305;z gereken en önemli &#351;ey, programlar&#305;n&#305;z&#305; sizden ba&#351;ka ki&#351;ilerin 
de kolayl&#305;kla anlayabilece&#287;i &#351;ekilde yazman&#305;zd&#305;.Bu çok fazla uygulama yapmay&#305; ve 
biraz da dü&#351;ünmeyi gerektirir. Ancak, yazd&#305;&#287;&#305;n&#305;z notlar&#305;n ba&#351;ka ki&#351;iler için 
oldu&#287;unu ve bu notlar&#305;n bilgisayar taraf&#305;ndan anla&#351;&#305;lmas&#305; gerekmedi&#287;ini 
unutmay&#305;n.Bu notlara <i>aç&#305;klama</i> denir. Programda <i>aç&#305;klama</i> yazman&#305;n bir kaç 
yolu vard&#305;r. Size Python'da kullan&#305;lan en basit yolu gösterece&#287;im. A&#351;a&#287;&#305;daki 
sat&#305;r&#305; program&#305;n&#305;z&#305;n ilk sat&#305;r&#305; olarak ekleyin. </p>
<pre>
# &#304;lk program&#305;m
</pre>
<p>A&#351;a&#287;&#305;daki gibi bir görüntü elde etmelisiniz:</p>
<pre>
<span class="comment"># &#304;lk program&#305;m</span>
move()
move()
turn_off()
</pre>
<p>E&#287;er renk körü de&#287;ilseniz # sembolü ile ba&#351;layan sat&#305;r&#305;n ye&#351;il oldu&#287;unu 
göreceksiniz. Bu sembol bu sat&#305;r&#305;n bir <i>aç&#305;klama</i> oldu&#287;unu ve Reeborg'un 
(ya da Python'un) bu sembolü gördükten sonra bu sat&#305;r&#305; okumayaca&#287;&#305; anlam&#305;na 
gelir. Aç&#305;klamalar&#305;n ye&#351;il ile gösterilmesi onlar&#305; komutlardan daha kolay ay&#305;rt 
etmemizi sa&#287;lar. </p>
<h3><span class="try">S&#305;ra sizde</span></h3>
<p># sembolünü&nbsp; bir komut sat&#305;r&#305;n&#305;n ba&#351;&#305;na koyarsan&#305;z ne olur. Bunu deneyin, 
program&#305;n&#305;z&#305; kaydedin ve çal&#305;&#351;t&#305;r&#305;n, Reeborg ne yap&#305;yor?</p>
<!--==============================================-->
<hr width="50%">

<h3 class="section">Reeborg'a biraz Türkçe ö&#287;retelim</h3>
<p>Reeborg'un yarat&#305;c&#305;lar&#305; onu planlarken &#304;ngilizce komutlar&#305; anlamaya 
programlad&#305;lar. Ancak&nbsp; herkes &#304;ngilizce anlamayabilir. Bu nedenle Reeborg'a 
ikinci bir dil ö&#287;renme kabiliyetini eklediler. Örne&#287;in Reeborg'un move komutunu 
Türkçe anlayabilmesi için <tt>git = move</tt><br />
&#351;eklinde bir sat&#305;r yaz&#305;labilir. Burada s&#305;ra önemlidir, bilinen komut sa&#287;da ve 
yeni komutta solda olmal&#305;d&#305;r. Parantezlerin kullan&#305;lmad&#305;&#287;&#305;na dikkat edin, 
parantezler Reeborg'a komutlar&#305; yerine getirmesini söylemek için kullan&#305;l&#305;yordu, 
burada ise ona yeni bir kelime ö&#287;retiyoruz. Yeni komuta uymas&#305;n&#305; istedi&#287;imizde 
ona <tt>git()</tt><font face="Times New Roman"><tt><font face="Times New Roman"> 
dememiz yeterlidir</font></tt>.</font></p>
<h3 class="try">S&#305;ra sizde</h3>
<p>A&#351;a&#287;&#305;daki program&#305; yaz&#305;n:</p>
<pre>
git = move
git()
turn_off()
</pre>
<p>program&#305; &quot;git.rur" ad&#305;yla kaydedin ve deneyin.</p>
<h3 class="suggested">Deney!</h3>
<p>&#304;sterseniz <tt>turn_off</tt><font face="Times New Roman"><tt><font face="Times New Roman">'un 
Türkçesini de ö&#287;retebilirsiniz yada ba&#351;ka bir dilde komutlar ö&#287;retebilirsiniz</font></tt>.</font></p>
<center><a href="4-errors.htm"><img alt="previous" src=
"../../images/previous.png"> Hatalar&#305; gidermek</a> - <a href=
"../lessons_toc.htm"><img alt="home" src="../../images/home.png"></a> - 
<a href=
"6-left.htm">Sola dönü&#351; yapmak <img alt="next" src=
"../../images/next.png"></a></center>
</body>
</html>
