Repository: aroberge/rur-ple
Catalog: trunk/rur_locale/*/*.po
Languages: de

source: RUR: a Python Learning Environment
de: RUR: eine Python LernumgEbung

source: RUR: Read and Learn
de: RUR: Lesen und Lernen

source: Robot: Code and Learn
de: Robot: Programmieren und Lernen

source: Python: Code and Learn
de: Python: Programmieren und Lernen

source: Python: simple editor
de: Python: Editor

source: Robot program has changed. You may save it before quitting.
de: Das Roboterprogramm wurde geändert. Vor dem Beenden solltest Du es speichern.

source: Program has been changed
de: Das Programm wurde verändert

source: World files (*.wld)|*.wld| All files (*.*)|*.*
de: Welt-Dateien (*.wld)|*.wld| Alle Dateien (*.*)|*.*

source: Choose a file
de: Wähle eine Datei

source: Problem with %s Please recreate world file.
de: Problem mit %s Bitte erstelle die Weltdatei neu.

source: avenues
de: Wege

source: Invalid world file format
de: Ungültiges Format der Weltdatei

source: streets
de: Strassen

source: robot
de: Roboter

source: beepers
de: Piepser

source: walls
de: Wände

source: Save new world as
de: Speichere neue Welt unter

source: Program files (*.rur)|*.rur| All files (*.*)|*.*
de: Programmdateien (*.rur)|*.rur| Alle Dateien (*.*)|*.*

source: Save new program as
de: Speichere neues Programm unter

source: Program will not be saved.
de: Das Programm wird nicht gespeichert.

source: Program is running
de: Programm läuft

source: Program paused
de: Programm pausiert

source: Program not running
de: Das Programm läuft nicht

source: No robot in world to give beepers to.
de: Kein Roboter in dieser Welt dem ein Piepser gegeben werden kann.

source: Beepers!
de: Piepser!

source: World size!
de: Weltgröße!

source: Opens existing robot program
de: Öffne bestehendes Roboterprogramm

source: Saves robot program
de: Speichere Roboterprogramm

source: Opens existing world file
de: Öffne existierende Weltdatei

source: Saves world file
de: Speichere Welt-Datei

source: Resets world - from open file
de: Welt zurücksetzen aus der offenen Datei

source: Runs robot program
de: Starte Roboterprogramm

source: Steps through robot program instructions
de: Gehe schrittweise durch die Instruktionen des Roboterprogramms

source: Pause program
de: Pausiere Programm

source: Stops program
de: Stoppe Programm

source: Adjust robot speed
de: Passe Robotergeschwindigkeit an

source: Edit walls
de: Bearbeite Wände

source: Resize world
de: Verändere Größe der Welt

source: Give beepers to robot
de: Gib Piepser dem Roboter

source: Remove/add robot from/to world
de: Entferne/Setze Roboter aus/in Welt

source: Toggle world file view
de: Ändere Ansicht der Weltdatei

source: Open Python file
de: Öffne Python Datei

source: Save Python file
de: Speichere Python Datei

source: Run Python program
de: Starte Python Programm

source: Run program with argument list
de: Starte Programm mit Argumenten

source: Help
de: Hilfe

source: Go to line number
de: Springe zu Zeile

source: Hide or show output window
de: Ausgabefenster anzeigen/verstecken

source: Change layout
de: Ändere Layout

source: Clear text
de: Text löschen

source: Open local html file
de: Öffne lokale HTML-Datei

source: Go back in browser history
de: Schritt zurück in der Browserhistorie.

source: Home
de: Anfang

source: Go forward in browser history
de: Schritt vor in der Browserhistorie.

source: Select a language
de: Wähle eine Sprache

source: html files (*.htm*)|*.htm*| All files (*.*)|*.*
de: HTML Dateien (*.htm*)|*.htm*| Alle Dateien (*.*)|*.*

source: Error found in your program.
de: Fehler in deinem Programm gefunden.

source: Hey! You stopped me!
de: Hey, du hast mich angehalten!

source: All done!
de: Alles erledigt!

source: No instruction to execute.
de: Kein ausführbarer Befehl.

source: You forgot to turn me off!
de: Du hast vergessen, mich auszuschalten!

source: Error found near line %s.
de: Fehler bei Zeile %s gefunden.

source: Execution error
de: Ausführungsfehler

source: %s Unrecognized instruction.
de: %s Unbekannter Befehl.

source: Error
de: Fehler

source: Turn off
de: Ausschalten

source: Success!
de: Erfolg!

source: Select the desired value, or sum of values as the number of beepers to put in the robot's beeper bag.
de: Wähle den gewünschten Wert oder eine Summe von Werten als Anzahl von Piepsern, die der Roboter in seinem Sack trägt.

source: Select the desired world dimensions (streets and avenues). The existing walls and beepers will be removed.
de: Wähle die gewünschten Weltdimensionen (Strassen und Wege). Alle existierenden Wände und Piepser werden entfernt.

source: Found a word not allowed:
de: Unerlaubtes Wort gefunden:

source: That move really hurt! Please, make sure that there is no wall in front of me!
de: Diese Bewegung hat weh getan! Bitte stelle sicher, dass keine Wand vor mir ist.

source: I obey your command: turning myself off.
de: Ich gehorche deinem Befehl: schalte mich nun aus.

source: put_beeper() failed. I am not carrying any beepers.
de: put_beeper() fehlgeschlagen. Ich trage keine Piepser.

source: pick_beeper failed. I must be next to a beeper before I can pick it up.
de: pick_beeper() fehlgeschlagen. Ich muss neben einem Piepser stehen bevor ich ihn aufheben kann.

source: Setting delay failed. Accepted values are between 0 and 10.
de: Setzen der Verzögerung fehlgeschlagen. Der akzeptierte Bereich liegt zwischen 0 und 10.

source: No program loaded
de: Kein Programm geladen

source: Robot has %s beeper
de: Der Roboter hat %s Piepser

source: Default world
de: Vorgabewelt

source: No robot in this world
de: Kein Roboter in dieser Welt

source: World file: %s
de: Welt-Datei: %s

source: Program File: %s
de: Programmdatei: %s

source: Robot has %s beepers
de: Der Roboter hat %s Piepser

source: not found in module useful.
de: nicht sinnvoll in diesem Modul.

source: import keyword used improperly
de: import Schlüsselwort falsch benutzt

source: Avenue
de: Weg

source: Street
de: Strasse
