Repository: aroberge/rur-ple
Catalog: rur_locale/*/*.po
Languages: it

source: RUR: a Python Learning Environment
it: RUR: un ambiente per imparare Python

source: RUR: Read and Learn
it: RUR: leggere e imparare

source: Robot: Code and Learn
it: Robot: codificare e imparare

source: Python: Code and Learn
it: Python: codificare e imparare

source: Python: simple editor
it: Python: un semplice editor

source: Robot program has changed. You may save it before quitting.
it: Il programma del robot è stato modificato. Puoi salvarlo prima di uscire.

source: Program has been changed
it: Il tuo programma è stato modificato

source: World files (*.wld)|*.wld| All files (*.*)|*.*
it: File dei mondi (*.wld)|*.wld| Tutti i file (*.*)|*.*

source: Choose a file
it: Scegli un file

source: Problem with %s Please recreate world file.
it: Problema con %s Per favore, ricreate il file del mondo.

source: avenues
it: viali

source: Invalid world file format
it: Formato del file del mondo non valido

source: streets
it: vie

source: beepers
it: sonagli

source: walls
it: muri

source: Save new world as
it: Salva il mondo come...

source: Program files (*.rur)|*.rur| All files (*.*)|*.*
it: File del programma (*.rur)|*.rur| Tutti i file (*.*)|*.*

source: Save new program as
it: Salva il programma con un altro nome

source: Program will not be saved.
it: Il programma non verrà salvato.

source: Program is running
it: Il programma sta funzionando

source: Program paused
it: Pausa - in attesa

source: Program not running
it: Il programma è fermo

source: No robot in world to give beepers to.
it: Non ci sono robot a cui dare i sonagli in questo mondo.

source: Beepers!
it: Sonagli!

source: World size!
it: Grandezza del mondo!

source: Opens existing robot program
it: Apri un programma esistente

source: Saves robot program
it: Salva programma

source: Opens existing world file
it: Apri un mondo esistente

source: Saves world file
it: Salva mondo

source: Resets world - from open file
it: Reimposta il mondo

source: Runs robot program
it: Esegui il programma

source: Steps through robot program instructions
it: Esegui un'istruzione per volta

source: Pause program
it: Metti in pausa il programma

source: Stops program
it: Arresta il programma

source: Adjust robot speed
it: Cambia la velocità del robot

source: Edit walls
it: Cambia i muri

source: Resize world
it: Cambia la dimensione del mondo

source: Give beepers to robot
it: Dai sonagli al robot

source: Remove/add robot from/to world
it: Togli/metti il robot dal mondo

source: Toggle world file view
it: Mostra/nascondi il mondo

source: Open Python file
it: Apri un file Python

source: Save Python file
it: Salva il file Python

source: Run Python program
it: Esegui il programma Python

source: Run program with argument list
it: Esegui il programma con una lista di argomenti

source: Help
it: Aiuto

source: Go to line number
it: Vai alla riga numero

source: Hide or show output window
it: Mostra/nascondi la finestra di output

source: Change layout
it: Modifica la disposizione delle finestre

source: Clear text
it: Cancella il testo

source: Open local html file
it: Apri un file html locale

source: Go back in browser history
it: Indietro

source: Go forward in browser history
it: Avanti

source: Select a language
it: Scegli la lingua

source: html files (*.htm*)|*.htm*| All files (*.*)|*.*
it: File html (*.htm*)|*.htm*| Tutti i file (*.*)|*.*

source: Error found in your program.
it: Trovato errore nel tuo programma.

source: Hey! You stopped me!
it: Hei! Mi avete fermato!

source: All done!
it: Finito!

source: No instruction to execute.
it: Non ci sono più istruzioni da eseguire.

source: You forgot to turn me off!
it: Ti sei dimenticato di spegnermi!

source: Error found near line %s.
it: Trovato errore vicino alla riga %s.

source: Execution error
it: Errore d'esecuzione

source: %s Unrecognized instruction.
it: %s Istruzione sconosciuta.

source: Error
it: Errore

source: Turn off
it: Spegni

source: Success!
it: Successo!

source: Select the desired value, or sum of values as the number of beepers to put in the robot's beeper bag.
it: Scegli il numero di sonagli da fornire al robot. Il numero scelto sarà la somma di due valori.

source: Select the desired world dimensions (streets and avenues). The existing walls and beepers will be removed.
it: Scegli la grandezza del mondo (vie e viali). I muri esistenti e i sonagli spariranno.

source: Found a word not allowed:
it: Parola non consentita:

source: That move really hurt! Please, make sure that there is no wall in front of me!
it: Mi sono fatto veramente male! Per piacere, controlla che non ci siano muri di fronte a me!

source: I obey your command: turning myself off.
it: Ho obbedito ai tuoi ordini. Mi spengo per risparmiare energia.

source: put_beeper() failed. I am not carrying any beepers.
it: Non posso eseguire il comando put_beeper(). Non ho più sonagli.

source: pick_beeper failed. I must be next to a beeper before I can pick it up.
it: Non posso eseguire il comando pick_beeper(). Devo essere vicino a un sonaglio per raccoglierlo.

source: Setting delay failed. Accepted values are between 0 and 10.
it: Il ritardo impostato non è valido. I valori devono essere compresi tra 0 e 10.

source: No program loaded
it: Nessun programma caricato

source: Robot has %s beeper
it: Il robot ha %s sonagli

source: Default world
it: Mondo di default

source: No robot in this world
it: Nessun robot in questo mondo.

source: World file: %s
it: File del mondo: %s

source: Program File: %s
it: File del programma: %s

source: Robot has %s beepers
it: Il robot ha %s sonagli

source: not found in module useful.
it: non esiste nel modulo useful.

source: import keyword used improperly
it: uso non consentito della parola "import"

source: Avenue
it: Viale

source: Street
it: Via
