<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content=
"text/html; charset=iso-8859-1">
<link rel='stylesheet' href='rurple.css' type='text/css'>
<title>About RUR-PLE</title>
</head>
<body>
<h2 class="title"><span style='color:#006600'>Python Ö&#287;reniyorum: RUR-PLE! ile oynamak<o:p></o:p></span></h2>
<h6>André Roberge, © 2005, 2006 Tercüme Nezih Tayyar (ntayyar@gmail.com)</h6>
<h3 class="section">RUR-PLE Hakk&#305;nda</h3>

<p>Basit anlamda, RUR-PLE Python'u ö&#287;renmek için haz&#305;rlanm&#305;&#351; bir pakettir. 
Python dilinde e&#287;lenerek program yazmay&#305; Reeborg ad&#305;ndaki bir robotun yard&#305;m&#305;yla 
ke&#351;fedebilirsiniz. Bir editör ve standard bir Python yorumlay&#305;c&#305;s&#305; da pakete 
dahil edilmi&#351;tir. </p>
<h3 class="section">Tarihçe</h3>
<p>Robot kelimesi ilk olarak 1920 y&#305;l&#305;nda, bir çek yazar olan Karel Capek'in 
yazd&#305;&#287;&#305; R.U.R (Rossum's Universal Robots) adl&#305; bir oyunda kullan&#305;lm&#305;&#351;t&#305;r. Capek 
o zamanlarda bu kelimenin bu kadar çok yayg&#305;la&#351;aca&#287;&#305;n&#305; herhalde tahmin 
edememi&#351;tir!</p>
<p>1981'de Richard Pattis'in 
<em>&quot;Karel the Robot, a Gentle Introduction to the Art of Programming&quot;</em> adl&#305; 
kitab&#305; yazmas&#305; ile birlikte Karel Capek'in ad&#305;da bilgisayar programc&#305;lar&#305; 
aras&#305;nda duyulmaya ba&#351;lad&#305;. Pattis bu kitab&#305;nda s&#305;ral&#305; programlamay&#305; (döngüleri 
ve kararlar&#305; dahil ederek ancak de&#287;i&#351;enleri dahil etmeden) yaln&#305;zca temel dört 
hareket (sola dönmek, bir ad&#305;m ileri atmak, bipleri almak ve koymak) yapabilen 
bir robot yard&#305;m&#305;yla anlatt&#305;. Programlaman&#305;n sihriyle, robot bu dört temel 
hareketi kullanarak karma&#351;&#305;k görevleri yerine getirdi. Pattis o günlerde popüler 
olan Pascal programlama dilini seçmi&#351;ti.O günden bu güne, Karel robotunun pek 
çok yeni sürümü yap&#305;ld&#305;, bunlar&#305;n içerisinde nesneye dayal&#305; programlama dilleri 
olan Java ve C++' da vard&#305;r.</p>
<p>Ancak, Java ve C++'&#305;n karma&#351;&#305;k yap&#305;s&#305; robot dünyas&#305;n&#305;n basit yap&#305;s&#305; ile bir 
z&#305;tl&#305;k olu&#351;turdu.</p>
<p>Python, Java ve C++ gibi nesneye dayal&#305; bir dildir. Ancak, Python'u Pattis'in 
robotuna uygun olacak bir &#351;ekilde nesneye dayal&#305; programlamay&#305; kullanmadan da 
kullanabilirsiniz. Karel robotunun ilk uyarlamas&#305;na PyKarel ad&#305; verildi. &#350;imdiki 
uyarlamas&#305; ise Guido van
Robot (k&#305;saca GvR ) olarak bilinir ve sourceforge.net'ten ula&#351;&#305;labilir.</p>
<p><em>RUR: bir Python Ö&#287;renme Paketi</em> 
(RUR-PLE <i>veya</i> Rur-ple <i>veya</i> rur-ple),&nbsp;GvR'&#305;n yeni ve 
geli&#351;tirilmi&#351; bir versiyonudur, Pattis'in yapt&#305;klar&#305;na de&#287;i&#351;kenleri, 
fonksiyonlar&#305;, metodlar&#305;, s&#305;n&#305;flar&#305; ve nesneleri de ilave eder.Rur-ple'daki 
dersler tüm Python komutlar&#305;n&#305; içerir, bunun yan&#305; s&#305;ra bir Python yorumlay&#305;c&#305;s&#305; 
ve bir de editör içerir.</p>
<p><em>Reeborg</em> Pattis'in 1981'de yaratt&#305;&#287;&#305; robottan esinlenerek yarat&#305;ld&#305; 
ve art&#305;k ya&#351;land&#305;, bu nedenle ya&#287; s&#305;zd&#305;r&#305;yor, s&#305;zd&#305;rd&#305;&#287;&#305; ya&#287;lardan onu takip 
edebilirsiniz! Yaln&#305;zca kuzeye bakt&#305;&#287;&#305;n&#305; gösteren k&#305;r&#305;k bir pusulas&#305; var.</p>
<p>&nbsp;</p>
<center><a href="rur.htm"><img alt="home" src=
"../images/home.png"></a></center>
</body>
</html>
