<!DOCTYPE html PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<meta http-equiv="Content-Type" content=
"text/html; charset=iso-8859-1">
<link rel='stylesheet' href='rurple.css' type='text/css'>
<title>Acknowledgements</title>
</head>
<body>
<h2 class="title"><span style='color:#006600'>Python Ö&#287;reniyorum: RUR-PLE! ile oynamak<o:p></o:p></span></h2>
<h6>André Roberge, © 2005, 2006</h6>
<h3 class="section">Te&#351;ekkürler</h3>

<p>Çocuklar&#305;m Julien ve Evelyne olmasayd&#305; bu program olmazd&#305;. Onlar&#305;n bu paket 
yard&#305;m&#305;yla programlaman&#305;n temellerini e&#287;lenerek ö&#287;renmeleri umuyorum ve bu 
paketi onlara ithaf ediyorum. Julien'a&nbsp; robot resimlerini ve 
kullan&#305;ld&#305;klar&#305; ekranlar&#305; tasarlad&#305;&#287;&#305; için ayr&#305;ca te&#351;ekkür ediyorum.</p>
<p>Bu paketi haz&#305;rlayarak çok &#351;ey ö&#287;rendim. Asl&#305;nda Python ö&#287;renmeye bu paketi 
haz&#305;rlamaya ba&#351;lamadan bir kaç ay önce ba&#351;lad&#305;&#287;&#305;m&#305; itiraf etmeliyim. 
Python ve 
wxPython'la ilgilenen ve geli&#351;mesine katk&#305; sa&#287;layan ki&#351;iler olmasayd&#305;, benim 
ö&#287;renmem çok daha zor olacak ve bu paketin haz&#305;rlanmas&#305; mümkün olmayacakt&#305;.&nbsp; 
Bu program Guido van Robot (GvR)'dan esinlenerek yarat&#305;ld&#305;. Guido van Robot (GvR) 
ise Pattis'in&nbsp; orjinal &quot;Karel the Robot&quot;'unun Python'a uyarlanm&#305;&#351;&#305;d&#305;r. GvR 
geli&#351;tiricilerinden bana çok yarar&#305; olan de&#287;erlendirmeler ald&#305;m&nbsp; özellikle Stas
Zykiewicz'e bana wxPython'u ö&#287;renmemde yard&#305;mc&#305; oldu&#287;u ve yazd&#305;&#287;&#305;m programlar&#305; 
kontrol etti&#287;i için çok te&#351;ekkür ediyorum.</p>
<p>Butanlarda kullan&#305;lan pek çok resim Davis Vignoni taraf&#305;ndan tasarlanan 
Nuvola ikon setinden al&#305;nd&#305;. Ke&#351;ke bende onun tasarlad&#305;&#287;&#305; gibi güzel ve estetik 
resimler tasarlayabilseydim.</p>
<p>Tony Payzant derslerin ilk sürümlerini kontrol etmek için çok zaman harcad&#305;. Bob Gailer 
yararl&#305; olacak düzeltmeler önerdi.</p>
<p>Luis Sureda &#304;spanyolca çeviriyi yapt&#305; ve dil seçimi ile ilgili kodlamalar&#305; 
basitle&#351;tirecek tavsiyeler de bulundu. </p>
<p>Richard E. Brown rur-ple'&#305;n MacOS'da daha iyi çal&#305;&#351;mas&#305;n&#305; sa&#287;layacak 
tavsiyelerde bulundu.</p>
<center><a href="rur.htm"><img alt="home" src=
"../images/home.png"></a></center>
</body>
</html>
